app/Views/Roles/admin/dashboard.php

        // All-time paid
        $builder = $db->table('pharmacy_transactions')->selectSum('total_amount', 'sum');
        if ($hasStatus) { $builder->where('status', 'completed'); }
        $row = $builder->get()->getRowArray();
---
SELECT SUM(`total_amount`) AS `sum`
FROM `pharmacy_transactions`


    // Patients and appointments
    if ($db->tableExists('patients')) {
        $row = $db->table('patients')->select('COUNT(*) AS c')->get()->getRowArray();
---
SELECT COUNT(*) AS c
FROM `patients`

        $fields = $db->getFieldData('patients'); $hasCreated=false; $createdCol='created_at';
        foreach ($fields as $f){ $n=strtolower($f->name ?? ''); if ($n==='created_at'||$n==='createdat'||$n==='date_created'){ $hasCreated=true; $createdCol=$f->name; break; } }
        if ($hasCreated) {
            $row = $db->table('patients')->select('COUNT(*) AS c')->where("DATE($createdCol)", date('Y-m-d'))->get()->getRowArray();
---
SELECT COUNT(*) AS c
FROM `patients`
WHERE DATE(created_at) = '2025-11-15'

        // active cases if patients has 'status' column
        $hasStatus=false; foreach($fields as $f){ if (strtolower($f->name ?? '')==='status'){ $hasStatus=true; $statusCol=$f->name; break; } }
        if ($hasStatus){
            $row = $db->table('patients')->select('COUNT(*) AS c')->groupStart()->where($statusCol,'active')->orWhere($statusCol,'admitted')->groupEnd()->get()->getRowArray();
---
SELECT COUNT(*) AS c
FROM `patients`
WHERE   (
`status` = 'active'
OR `status` = 'admitted'
 )