app/Controllers/Admin/Patients.php

SELECT `users`.`id`, COALESCE(NULLIF(CONCAT(d.first_name, ' ', d.last_name), ' '), users.username) AS display_name, `d`.`first_name`, `d`.`last_name`, `users`.`username`
FROM `users`
LEFT JOIN `roles` `r` ON `users`.`role_id` = `r`.`id`
LEFT JOIN `doctors` `d` ON `d`.`user_id` = `users`.`id`
WHERE `r`.`name` = 'doctor'
AND `users`.`status` = 'active'
ORDER BY `d`.`first_name` ASC, `users`.`username` ASC
---
    public function inpatient()
    {
        $doctors = $this->userModel
            ->select("users.id, COALESCE(NULLIF(CONCAT(d.first_name, ' ', d.last_name), ' '), users.username) AS display_name, d.first_name, d.last_name, users.username")
            ->join('roles r', 'users.role_id = r.id', 'left')
            ->join('doctors d', 'd.user_id = users.id', 'left')
            ->where('r.name', 'doctor')
            ->where('users.status', 'active')
            ->orderBy('d.first_name', 'ASC')
            ->orderBy('users.username', 'ASC')
            ->findAll();