app/Controllers/Admin/Patients.php

SELECT `admission_details`.`id` AS `admission_id`, `admission_details`.`patient_id` AS `admission_patient_id`, `admission_details`.`admission_date`, `admission_details`.`admission_time`, `admission_details`.`admission_type`, `admission_details`.`status` AS `admission_status`, `admission_details`.`admitting_diagnosis`, `admission_details`.`reason_admission`, `admission_details`.`ward` AS `admission_ward`, `admission_details`.`room` AS `admission_room`, `admission_details`.`bed_id`, `patients`.*, `beds`.`ward` AS `bed_ward`, `beds`.`room` AS `bed_room`, `beds`.`bed` AS `bed_label`, `users`.`username` AS `physician_username`, COALESCE(CONCAT(doctors.first_name, ' ', doctors.last_name), users.username) AS physician_name, `role`.`name` AS `physician_role`
FROM `admission_details`
LEFT JOIN `patients` ON `patients`.`id` = `admission_details`.`patient_id`
LEFT JOIN `beds` ON `beds`.`id` = `admission_details`.`bed_id`
LEFT JOIN `users` ON `users`.`id` = `admission_details`.`attending_physician`
LEFT JOIN `doctors` ON `doctors`.`user_id` = `users`.`id`
LEFT JOIN `roles` `role` ON `role`.`id` = `users`.`role_id`
WHERE `admission_details`.`status` = 'admitted'
ORDER BY CASE WHEN role.name = "doctor" THEN 0 ELSE 1 END ASC, `admission_details`.`created_at` DESC, `admission_details`.`id` DESC, `admission_details`.`admission_date` DESC, `admission_details`.`admission_time` DESC
---
    protected function getAdmittedPatients(): array
    {
        $rows = $this->admissionModel
            ->select([
                'admission_details.id AS admission_id',
                'admission_details.patient_id AS admission_patient_id',
                'admission_details.admission_date',
                'admission_details.admission_time',
                'admission_details.admission_type',
                'admission_details.status AS admission_status',
                'admission_details.admitting_diagnosis',
                'admission_details.reason_admission',
                'admission_details.ward AS admission_ward',
                'admission_details.room AS admission_room',
                'admission_details.bed_id',
                'patients.*',
                'beds.ward AS bed_ward',
                'beds.room AS bed_room',
                'beds.bed AS bed_label',
                'doctors.id AS attending_doctor_id',
                'users.username AS physician_username',
                "COALESCE(NULLIF(CONCAT(TRIM(doctors.first_name), ' ', TRIM(doctors.last_name)), ' '), users.username, CONCAT('Doctor #', doctors.id)) AS physician_name",
                'role.name AS physician_role',
            ])
            ->join('patients', 'patients.id = admission_details.patient_id', 'left')
            ->join('beds', 'beds.id = admission_details.bed_id', 'left')
            ->join('doctors', 'doctors.id = admission_details.attending_doctor_id', 'left')
            ->join('users', 'users.id = doctors.user_id', 'left')
            ->join('roles role', 'role.id = users.role_id', 'left')
            ->where('admission_details.status', 'admitted')
            ->orderBy('CASE WHEN role.name = "doctor" THEN 0 ELSE 1 END', 'ASC', false)
            ->orderBy('admission_details.created_at', 'DESC')
            ->orderBy('admission_details.id', 'DESC')
            ->orderBy('admission_details.admission_date', 'DESC')
            ->orderBy('admission_details.admission_time', 'DESC')
            ->findAll();