app/Controllers/Admin/Rooms.php

SELECT *
FROM `beds`
WHERE `ward` = 'ICU'
ORDER BY `room` ASC, `bed` ASC
SELECT *
FROM `patients`
WHERE `type` = 'inpatient'
AND `bed_id` IN ('1','2','3','4','5','6')
---
    protected function getICURows(string $wardName): array
    {
        // Load configured beds for this ICU unit from beds table
        $beds = $this->beds
            ->where('ward', $wardName)
            ->orderBy('room', 'ASC')
            ->orderBy('bed', 'ASC')
            ->findAll();

        // Get all bed IDs for this ward
        $bedIds = array_column($beds, 'id');

        // Load all inpatients assigned to beds in this ward (using bed_id)
        $patients = [];
        if (!empty($bedIds)) {
            $patients = $this->patients
                ->where('type', 'inpatient')
                ->whereIn('bed_id', $bedIds)
                ->findAll();