app/Services/Billing/Providers/AbstractChargeProvider.php

    protected function filterOutAlreadyLinked(array $rows, string $sourceTable, string $idKey = 'id'): array
    {
        if (empty($rows) || !$this->tableExists('billing_items')) {
            return $rows;
        }
        // Check if source_table and source_id columns exist
        if (!$this->fieldExists('billing_items', 'source_table') || !$this->fieldExists('billing_items', 'source_id')) {
            return $rows;
        }
        $ids = array_values(array_filter(array_map(function ($row) use ($idKey) {
            return $row[$idKey] ?? null;
        }, $rows)));
        if (empty($ids)) {
            return $rows;
        }
        try {
            $existing = $this->db->table('billing_items')
                ->select('source_id')
                ->where('source_table', $sourceTable)
                ->whereIn('source_id', $ids)
                ->get()->getResultArray();
---
SELECT `source_id`
FROM `billing_items`
WHERE `source_table` = 'laboratory'
AND `source_id` IN ('LAB-002','LAB-003')