app/Services/Billing/Providers/AppointmentChargeProvider.php

    public function getCharges(string $patientId): array
    {
        $patientId = trim($patientId);
        if ($patientId === '' || !$this->tableExists('appointments')) {
            return [];
        }

        $builder = $this->db->table('appointments a');
        $builder->select('a.id, a.appointment_date, a.appointment_time, a.status, a.doctor_id, a.appointment_type, d.consultation_fee, d.first_name, d.last_name, u.username');
        $builder->where('a.patient_id', $patientId);
        if (!empty($this->billableStatuses)) {
            $builder->whereIn('a.status', $this->billableStatuses);
        }
        if ($this->fieldExists('appointments', 'billed')) {
            $builder->groupStart()
                ->where('a.billed', 0)
                ->orWhere('a.billed IS NULL', null, false)
                ->groupEnd();
        }
        if ($this->tableExists('doctors')) {
            $builder->join('doctors d', '(d.user_id = a.doctor_id OR d.id = a.doctor_id)', 'left', false);
        } else {
            $builder->select('NULL as consultation_fee');
        }
        if ($this->tableExists('users')) {
            $builder->join('users u', 'u.id = a.doctor_id', 'left');
        } else {
            $builder->select('NULL as username');
        }
        $builder->orderBy('a.appointment_date', 'DESC');
        $appointments = $builder->get()->getResultArray();
---
SELECT `type`
FROM `patients`
WHERE `id` = 'PAT-251213-0002'