app/Services/Billing/Providers/DoctorFeeProvider.php

    public function getCharges(string $patientId): array
    {
        $patientId = trim($patientId);
        if ($patientId === '') {
            return [];
        }

        $items = [];

        // Get admissions for this patient
        if (!$this->tableExists('admission_details')) {
            return $items;
        }

        $builder = $this->db->table('admission_details ad');
        $builder->select('ad.id, ad.patient_id, ad.admission_date, ad.admission_time, ad.status, ad.attending_doctor_id');
        $builder->where('ad.patient_id', $patientId);

        // Filter by billed status if field exists
        if ($this->fieldExists('admission_details', 'billed')) {
            $builder->groupStart()
                ->where('ad.billed', 0)
                ->orWhere('ad.billed IS NULL', null, false)
                ->groupEnd();
        }

        // Include all active admissions (we'll handle incremental billing below)
        $builder->whereIn('ad.status', ['admitted', 'discharged'])
            ->orderBy('ad.admission_date', 'DESC');
        $admissions = $builder->get()->getResultArray();
---
SELECT `ad`.`id`, `ad`.`patient_id`, `ad`.`admission_date`, `ad`.`admission_time`, `ad`.`status`, `ad`.`attending_doctor_id`
FROM `admission_details` `ad`
WHERE `ad`.`patient_id` = 'PAT-251213-0002'
AND   (
`ad`.`billed` = 0
OR ad.billed IS NULL
 )
AND `ad`.`status` IN ('admitted','discharged')
ORDER BY `ad`.`admission_date` DESC

            $admissionIds = array_filter($admissionIds);

            if (!empty($admissionIds)) {
                $billedItems = $this->db->table('billing_items')
                    ->select('source_id, qty')
                    ->where('source_table', 'admission_doctor_fee')
                    ->whereIn('source_id', $admissionIds)
                    ->get()
                    ->getResultArray();
---
SELECT `source_id`, `qty`
FROM `billing_items`
WHERE `source_table` = 'admission_doctor_fee'
AND `source_id` IN (17)


        $doctors = [];
        if (!empty($doctorIds) && $this->tableExists('staff_profiles') && $this->tableExists('users')) {
            $doctorRows = $this->db->table('staff_profiles sp')
                ->select('sp.id, sp.first_name, sp.last_name, users.username')
                ->join('users', 'users.id = sp.user_id', 'left')
                ->whereIn('sp.id', $doctorIds)
                ->get()
                ->getResultArray();
---
SELECT `sp`.`id`, `sp`.`first_name`, `sp`.`last_name`, `users`.`username`
FROM `staff_profiles` `sp`
LEFT JOIN `users` ON `users`.`id` = `sp`.`user_id`
WHERE `sp`.`id` IN ('3')

        $dailyRate = $this->defaultDailyRate;

        if ($this->serviceModel !== null) {
            $service = $this->serviceModel->where('code', 'FEE-DOCTOR-DAILY')
                ->where('active', 1)
                ->first();
---
SELECT *
FROM `services`
WHERE `code` = 'FEE-DOCTOR-DAILY'
AND `active` = 1
 LIMIT 1