app/Services/Billing/Providers/LaboratoryChargeProvider.php

SELECT *
FROM `laboratory`
WHERE `status` = 'completed'
AND   (
`patient_id` = 'PAT-251213-0002'
OR  `test_name` LIKE '%Frenchie RM Labasa%' ESCAPE '!'
OR  `test_name` LIKE '%Frenchie%' ESCAPE '!'
OR  `test_name` LIKE '%RM%' ESCAPE '!'
OR  `test_name` LIKE '%Labasa%' ESCAPE '!'
 )
AND   (
`billed` = 0
OR billed IS NULL
 )
ORDER BY `test_date` DESC
---
    public function getCharges(string $patientId): array
    {
        $patientId = trim($patientId);
        if ($patientId === '' || !$this->tableExists('laboratory')) {
            return [];
        }

        $patientName = $this->resolvePatientName($patientId);

        $builder = $this->db->table('laboratory');
        $builder->select('*');
        $builder->where('status', 'completed');
        $builder->groupStart()
            ->where('patient_id', $patientId);
        if ($patientName !== '') {
            $builder->orLike('test_name', $patientName, 'both');
            foreach ($this->tokenizeName($patientName) as $token) {
                $builder->orLike('test_name', $token, 'both');
            }
        }
        $builder->groupEnd();
        if ($this->fieldExists('laboratory', 'billed')) {
            $builder->groupStart()
                ->where('billed', 0)
                ->orWhere('billed IS NULL', null, false)
                ->groupEnd();
        }
        $builder->orderBy('test_date', 'DESC');
        $rows = $builder->get()->getResultArray();

SELECT `lab_id`
FROM `billing_items`
WHERE `lab_id` IN ('LAB-002','LAB-003')
---

                    // Check for items linked via lab_id (if column exists)
                    if ($this->fieldExists('billing_items', 'lab_id')) {
                        $linkedByLabId = $this->db->table('billing_items')
                            ->select('lab_id')
                            ->whereIn('lab_id', $ids)
                            ->get()->getResultArray();

SELECT `source_id`
FROM `billing_items`
WHERE `source_table` = 'laboratory'
AND `source_id` IN ('LAB-002','LAB-003')
---

                    // Check for items linked via source_table and source_id (if columns exist)
                    if ($this->fieldExists('billing_items', 'source_table') && $this->fieldExists('billing_items', 'source_id')) {
                        $linkedBySource = $this->db->table('billing_items')
                            ->select('source_id')
                            ->where('source_table', 'laboratory')
                            ->whereIn('source_id', array_map('strval', $ids))
                            ->get()->getResultArray();

SELECT *
FROM `patients`
WHERE `id` = 'PAT-251213-0002'
 LIMIT 1
---
    protected function resolvePatientName(string $patientId): string
    {
        if ($this->patientModel === null || !$this->tableExists('patients')) {
            return '';
        }
        try {
            $row = $this->patientModel->select('*')->where('id', $patientId)->first();