app/Services/Billing/Providers/PharmacyChargeProvider.php

    public function getCharges(string $patientId): array
    {
        $patientId = trim($patientId);
        if ($patientId === '' || !$this->tableExists('pharmacy_transactions')) {
            return [];
        }

        $builder = $this->db->table('pharmacy_transactions pt');
        // Check if prescription_id field exists in pharmacy_transactions
        $hasPrescriptionId = $this->fieldExists('pharmacy_transactions', 'prescription_id');
        if ($hasPrescriptionId) {
            $builder->select('pt.id, pt.transaction_number, pt.date, pt.total_amount, pt.patient_id, pt.prescription_id');
        } else {
            $builder->select('pt.id, pt.transaction_number, pt.date, pt.total_amount, pt.patient_id');
        }
        $builder->where('pt.patient_id', $patientId);
        if ($this->fieldExists('pharmacy_transactions', 'billed')) {
            $builder->groupStart()
                ->where('pt.billed', 0)
                ->orWhere('pt.billed IS NULL', null, false)
                ->groupEnd();
        }
        $builder->orderBy('pt.date', 'DESC');
        $rows = $builder->get()->getResultArray();
---
SELECT `pt`.`id`, `pt`.`transaction_number`, `pt`.`date`, `pt`.`total_amount`, `pt`.`patient_id`, `pt`.`prescription_id`
FROM `pharmacy_transactions` `pt`
WHERE `pt`.`patient_id` = 'PAT-251213-0002'
AND   (
`pt`.`billed` = 0
OR pt.billed IS NULL
 )
ORDER BY `pt`.`date` DESC