app/Services/Billing/Providers/RoomChargeProvider.php

SELECT `ad`.`id`, `ad`.`patient_id`, `ad`.`bed_id`, `ad`.`admission_date`, `ad`.`admission_time`, `ad`.`updated_at`, `ad`.`status`, `ad`.`ward`, `ad`.`room`
FROM `admission_details` `ad`
WHERE `ad`.`patient_id` = 'PAT-251213-0002'
AND   (
`ad`.`billed` = 0
OR ad.billed IS NULL
 )
AND `ad`.`status` IN ('admitted','discharged')
ORDER BY `ad`.`admission_date` DESC
---
    public function getCharges(string $patientId): array
    {
        $patientId = trim($patientId);
        if ($patientId === '') {
            return [];
        }

        $items = [];

        // First, try to get charges from admission_details table
        if ($this->tableExists('admission_details')) {
            $builder = $this->db->table('admission_details ad');
            $builder->select('ad.id, ad.patient_id, ad.bed_id, ad.admission_date, ad.admission_time, ad.updated_at, ad.status, ad.ward, ad.room');
            $builder->where('ad.patient_id', $patientId);

            // Filter by billed status
            if ($this->fieldExists('admission_details', 'billed')) {
                $builder->groupStart()
                    ->where('ad.billed', 0)
                    ->orWhere('ad.billed IS NULL', null, false)
                    ->groupEnd();
            }

            // Include all active admissions (we'll handle incremental billing below)
            $builder->whereIn('ad.status', ['admitted', 'discharged'])
                ->orderBy('ad.admission_date', 'DESC');
            $admissions = $builder->get()->getResultArray();

SELECT `source_id`, `qty`
FROM `billing_items`
WHERE `source_table` = 'admission_details'
AND `source_id` IN (17)
---
                    $admissionIds = array_filter($admissionIds);

                    if (!empty($admissionIds)) {
                        $billedItems = $this->db->table('billing_items')
                            ->select('source_id, qty')
                            ->where('source_table', 'admission_details')
                            ->whereIn('source_id', $admissionIds)
                            ->get()
                            ->getResultArray();

SELECT *
FROM `beds`
WHERE `id` IN (120)
---
    protected function loadBeds(array $bedIds): array
    {
        $bedIds = array_values(array_unique(array_filter(array_map('intval', $bedIds))));
        if (empty($bedIds) || !$this->tableExists('beds')) {
            return [];
        }
        $rows = $this->db->table('beds')->whereIn('id', $bedIds)->get()->getResultArray();

SELECT *
FROM `services`
WHERE `code` = 'ROOM-WARD'
AND `active` = 1
AND `category` = 'room'
 LIMIT 1
---

        if ($code) {
            try {
                $service = $this->serviceModel->where('code', $code)
                    ->where('active', 1)
                    ->where('category', 'room')
                    ->first();