app/Controllers/Admissions.php

    public function create()
    {
        // Only admin, nurse, and receptionist can create admissions
        $this->requireRole(['admin', 'nurse', 'receptionist']);

        // Doctors list for dropdown (doctor_id used as FK to staff_profiles)
        $doctors = $this->userModel
            ->select("sp.id AS doctor_id, users.id AS user_id, COALESCE(NULLIF(CONCAT(sp.first_name, ' ', sp.last_name), ' '), users.username) AS display_name, sp.first_name, sp.last_name, users.username")
            ->join('roles r', 'users.role_id = r.id', 'left')
            ->join('staff_profiles sp', 'sp.user_id = users.id', 'left')
            ->where('r.name', 'doctor')
            ->where('users.status', 'active')
            ->where('sp.id IS NOT NULL', null, false)
            ->orderBy('sp.first_name', 'ASC')
            ->orderBy('users.username', 'ASC')
            ->findAll();
---
SELECT `sp`.`id` AS `doctor_id`, `users`.`id` AS `user_id`, COALESCE(NULLIF(CONCAT(sp.first_name, ' ', sp.last_name), ' '), users.username) AS display_name, `sp`.`first_name`, `sp`.`last_name`, `users`.`username`
FROM `users`
LEFT JOIN `roles` `r` ON `users`.`role_id` = `r`.`id`
LEFT JOIN `staff_profiles` `sp` ON `sp`.`user_id` = `users`.`id`
WHERE `r`.`name` = 'doctor'
AND `users`.`status` = 'active'
AND sp.id IS NOT NULL
ORDER BY `sp`.`first_name` ASC, `users`.`username` ASC