app/Controllers/Admin.php

SELECT `u`.`id`, `u`.`username`, `u`.`email`, `u`.`status`, `u`.`role_id`, `r`.`name` as `role_name`
FROM `users` `u`
LEFT JOIN `roles` `r` ON `r`.`id` = `u`.`role_id`
ORDER BY `u`.`id` DESC
SELECT `id`, `name`
FROM `roles`
ORDER BY `name` ASC
SELECT COUNT(*) AS `numrows`
FROM `users`
SELECT COUNT(*) AS `numrows`
FROM `users`
WHERE `status` = 'active'
SELECT COUNT(*) AS `numrows`
FROM `users` `u`
LEFT JOIN `roles` `r` ON `r`.`id` = `u`.`role_id`
WHERE `r`.`name` = 'Doctor'
SELECT COUNT(*) AS `numrows`
FROM `users` `u`
LEFT JOIN `roles` `r` ON `r`.`id` = `u`.`role_id`
WHERE `r`.`name` = 'Nurse'
---
    public function manageUsers()
    {
        $db = \Config\Database::connect();
        $users = $db->table('users u')
                    ->select('u.id, u.username, u.email, u.status, u.role_id, r.name as role_name')
                    ->join('roles r', 'r.id = u.role_id', 'left')
                    ->orderBy('u.id', 'DESC')
                    ->get()->getResultArray();
        $roles = $db->table('roles')->select('id, name')->orderBy('name','ASC')->get()->getResultArray();

        // Live statistics
        $totalUsers = $db->table('users')->countAllResults();
        $activeUsers = $db->table('users')->where('status', 'active')->countAllResults();
        $doctorCount = $db->table('users u')
                          ->join('roles r', 'r.id = u.role_id', 'left')
                          ->where('r.name', 'Doctor')
                          ->countAllResults();
        $nurseCount = $db->table('users u')
                         ->join('roles r', 'r.id = u.role_id', 'left')
                         ->where('r.name', 'Nurse')
                         ->countAllResults();