app/Controllers/Appointment.php

    public function book()
    {
        // Only admin, nurse, and receptionist can book appointments
        $this->requireRole(['admin', 'nurse', 'receptionist']);

        // Get doctors from users table via roles join (users.role removed)
        $doctors = $this->userModel
            ->select('users.*')
            ->join('roles r', 'users.role_id = r.id', 'left')
            ->where('r.name', 'doctor')
            ->where('users.status', 'active')
            ->findAll();

        $data = [
            'title' => 'Book Appointment',
            'active_menu' => 'appointments',
            'patients' => $this->patientModel->findAll(),
            'doctors' => $doctors
        ];
---
SELECT `users`.*
FROM `users`
LEFT JOIN `roles` `r` ON `users`.`role_id` = `r`.`id`
WHERE `r`.`name` = 'doctor'
AND `users`.`status` = 'active'

    public function getDoctorsByDate()
    {
        $allowedRoles = ['admin', 'nurse', 'receptionist'];
        if (!in_array(session('role'), $allowedRoles)) {
            return $this->response->setJSON(['success' => false, 'message' => 'Unauthorized'])->setStatusCode(401);
        }

        $date = $this->request->getGet('date');
        if (!$date || !preg_match('/^\d{4}-\d{2}-\d{2}$/', $date)) {
            return $this->response->setJSON(['success' => false, 'message' => 'Invalid date'])->setStatusCode(400);
        }

        $db = \Config\Database::connect();
        $rows = $db->table('doctor_schedules ds')
            ->select("ds.doctor_id, COALESCE(CONCAT(sp.first_name, ' ', sp.last_name), u.username) AS name, COALESCE(sp.email, u.email) as email")
            ->join('staff_profiles sp', 'sp.id = ds.doctor_id', 'left')
            ->join('users u', 'u.id = sp.user_id', 'left')
            ->where('ds.shift_date', $date)
            ->where('ds.status !=', 'cancelled')
            ->where('sp.status', 'active')
            ->groupBy('ds.doctor_id, name, u.email')
            ->orderBy('name', 'ASC')
            ->get()->getResultArray();
---
SELECT `ds`.`doctor_id`, COALESCE(CONCAT(sp.first_name, ' ', sp.last_name), u.username) AS name, COALESCE(sp.email, u.email) as email
FROM `doctor_schedules` `ds`
LEFT JOIN `staff_profiles` `sp` ON `sp`.`id` = `ds`.`doctor_id`
LEFT JOIN `users` `u` ON `u`.`id` = `sp`.`user_id`
WHERE `ds`.`shift_date` = '2025-12-13'
AND `ds`.`status` != 'cancelled'
AND `sp`.`status` = 'active'
GROUP BY `ds`.`doctor_id`, `name`, `u`.`email`
ORDER BY `name` ASC