app/Controllers/Auth.php

SELECT *
FROM `users`
WHERE `email` = 'doctor@hms.com'
OR `username` = 'doctor@hms.com'
 LIMIT 1
---
    public function process_login()
    {
        $session = session();
        $model = new UserModel();

<<<<<<< HEAD
        // Accept both 'email' and 'Email' keys from the form
        $identity = $this->request->getPost('email') ?? $this->request->getPost('Email');
        $password = $this->request->getPost('password');

        // Basic validation
        if (empty($identity) || empty($password)) {
            return redirect()->back()->with('error', 'Please enter your email/username and password.');
        }

        // Find user by email or username
        $user = $model->where('email', $identity)
                      ->orWhere('username', $identity)
                      ->first();