app/Controllers/Billing.php

SELECT *
FROM `hmo_providers`
WHERE `active` = 1
ORDER BY `name` ASC
---
    public function index()
    {
        // Only admin and accounting can access billing
        $this->requireRole(['admin', 'accounting']);

        $term = $this->request->getGet('q');
        $bills = $this->billingModel->getList($term);
        $totals = $this->billingModel->getTotals();
        return view($this->getRoleViewPath('billingmanagement'), [
            'bills' => $bills,
            'totals' => $totals,
            'query' => (string)($term ?? ''),
            'hmoProviders' => (new HmoProviderModel())
                ->where('active', 1)
                ->orderBy('name', 'ASC')
                ->findAll(),

SELECT *
FROM `hmo_providers`
WHERE `active` = 1
ORDER BY `name` ASC
---
    public function process($id = null)
    {
        // Only admin and accounting can process bills
        $this->requireRole(['admin', 'accounting']);

        $data = [
            'title' => 'Bill Process',
            'active_menu' => 'billing',
            'validation' => \Config\Services::validation(),
            'bill' => null,
            'billItems' => [],
            'hmoProviders' => (new HmoProviderModel())
                ->where('active', 1)
                ->orderBy('name', 'ASC')
                ->findAll(),
        ];

SELECT *
FROM `billing`
WHERE `patient_id` = 'PAT-251213-0002'
AND `payment_status` IN ('pending','partial','overdue')
ORDER BY `created_at` DESC
 LIMIT 1
---
    public function patientServices()
    {
        $patientId = trim((string)$this->request->getGet('patient_id'));
        if ($patientId === '') {
            return $this->response->setStatusCode(400)->setJSON(['error' => 'patient_id is required']);
        }

        $aggregator = new BillingChargeAggregator();
        $result = $aggregator->collect($patientId);

        // Check if there's an existing unpaid/pending bill for this patient
        $existingBill = $this->billingModel
            ->where('patient_id', $patientId)
            ->whereIn('payment_status', ['pending', 'partial', 'overdue'])
            ->orderBy('created_at', 'DESC')
            ->first();