app/Controllers/Dashboard.php

        try {
            // Get counts based on user role
            if (in_array($userRole, ['admin', 'receptionist', 'nurse', 'doctor'])) {
                $data['appointmentsCount'] = $appointmentModel->where('date', date('Y-m-d'))->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `appointments`
WHERE `date` = '2025-10-11'