app/Controllers/Laboratory.php

SELECT *
FROM `laboratory`
WHERE `laboratory`.`id` = 'LAB-001'
---
            $db = \Config\Database::connect();
            $builder = $db->table('laboratory');

            $testResult = $builder->where('id', $testId)->get()->getRowArray();