app/Controllers/Laboratory.php

SELECT `id`, `id` as `test_id`, `test_name` as `patient_name`, `test_type`, `test_date`, `status`, `notes`
FROM `laboratory`
ORDER BY `created_at` DESC
---
    public function getTestResultsData()
    {
        if (!session()->get('isLoggedIn') || !in_array(session()->get('role'), ['labstaff', 'doctor', 'admin'])) {
            return $this->response->setJSON(['success' => false, 'message' => 'Access denied']);
        }

        try {
            $db = \Config\Database::connect();
            $builder = $db->table('laboratory');

            // test_id column removed; expose numeric id as test_id for UI compatibility
            $results = $builder->select('id, id as test_id, test_name as patient_name, test_type, test_date, status, notes')
                              ->orderBy('created_at', 'DESC')
                              ->get()
                              ->getResultArray();

SELECT *
FROM `laboratory`
WHERE `id` = '1'
---
    public function viewTestResult($testId = null)
    {
        // Check if user is logged in and has appropriate role
        if (!session()->get('isLoggedIn') || !in_array(session()->get('role'), ['labstaff', 'doctor', 'admin'])) {
            return redirect()->to('/login')->with('error', 'Access denied. You do not have permission to access this page.');
        }

        if (empty($testId)) {
            return redirect()->to('laboratory/testresult')->with('error', 'Test ID is required');
        }

        try {
            $db = \Config\Database::connect();
            $builder = $db->table('laboratory');

            $testResult = $builder->where('id', $testId)->get()->getRowArray();