app/Controllers/Medicine.php

    public function index()
    {
        $model = new MedicineModel();
        $data['medicines'] = $model->orderBy('id', 'DESC')->findAll();

        // counts using fresh builders to avoid state leakage
        $data['total'] = (new MedicineModel())->countAll();
        $data['low_stock'] = (new MedicineModel())->where('stock <=', 5)->countAllResults();
        $data['out_stock'] = (new MedicineModel())->where('stock', 0)->countAllResults();
---
SELECT *
FROM `medicines`
ORDER BY `id` DESC
SELECT COUNT(*) AS `numrows` FROM `medicines`
SELECT COUNT(*) AS `numrows`
FROM `medicines`
WHERE `stock` <= 5
SELECT COUNT(*) AS `numrows`
FROM `medicines`
WHERE `stock` = 0