app/Controllers/Rooms.php

SELECT *
FROM `beds`
WHERE `ward` = 'Female Ward'
ORDER BY `room` ASC, `bed` ASC
---
    protected function getWardRows(string $wardName, ?callable $rowDecorator = null): array
    {
        $beds = $this->beds
            ->where('ward', $wardName)
            ->orderBy('room', 'ASC')
            ->orderBy('bed', 'ASC')
            ->findAll();

SELECT `admission_details`.`bed_id` AS `admission_bed_id`, `admission_details`.`status` AS `admission_status`, `admission_details`.`patient_id` AS `admission_patient_id`, `patients`.*
FROM `admission_details`
LEFT JOIN `patients` ON `patients`.`id` = `admission_details`.`patient_id`
WHERE `admission_details`.`status` = 'admitted'
AND `admission_details`.`bed_id` IN (106,107,108,109,110,111,112,113,114,115,116,117,118,119,120,121,122,123,124,125,126,127,128,129)
AND `admission_details`.`bed_id` IS NOT NULL
ORDER BY `admission_details`.`created_at` DESC
---
    protected function getBedOccupants(array $bedIds): array
    {
        $bedIds = array_filter(array_map('intval', $bedIds));
        if (empty($bedIds)) {
            return [];
        }

        // Query for active admissions with the given bed IDs
        // Use database query builder directly to ensure proper table name handling
        $db = \Config\Database::connect();
        $builder = $db->table('admission_details');
        $builder->select('admission_details.bed_id AS admission_bed_id, admission_details.status AS admission_status, admission_details.patient_id AS admission_patient_id, patients.*')
            ->join('patients', 'patients.id = admission_details.patient_id', 'left')
            ->where('admission_details.status', 'admitted')
            ->whereIn('admission_details.bed_id', $bedIds)
            ->where('admission_details.bed_id IS NOT NULL')
            ->orderBy('admission_details.created_at', 'DESC');

        $records = $builder->get()->getResultArray();