app/Models/BillingModel.php

    public function search(?string $term): array
    {
        $builder = $this->withRelations();
        if ($term) {
            $builder->groupStart()
                ->like('b.id', $term)
                ->orLike('p.first_name', $term)
                ->orLike('p.last_name', $term)
            ->groupEnd();
        }
        $builder->orderBy('b.created_at', 'DESC');
        return $builder->get()->getResultArray();
---
SELECT `b`.*, CONCAT(p.first_name, ' ', p.last_name) AS patient_name, `p`.`address` AS `patient_address`, `p`.`phone` AS `patient_phone`, `s`.`name` AS `service_name`, `s`.`base_price` AS `service_price`, `ha`.`loa_number` AS `hmo_loa_number`, `ha`.`coverage_limit` AS `hmo_coverage_limit`, `ha`.`approved_amount` AS `hmo_approved_amount`, `ha`.`patient_share` AS `hmo_patient_share`, `ha`.`status` AS `hmo_status`, `ha`.`notes` AS `hmo_notes`, `hp`.`name` AS `hmo_provider_name`, `hp`.`id` AS `hmo_provider_id`, `pha`.`suggested_amount` AS `philhealth_suggested_amount`, `pha`.`approved_amount` AS `philhealth_approved_amount`, `pha`.`codes_used` AS `philhealth_codes_used`, `pha`.`officer_user_id` AS `philhealth_verified_by`, `pha`.`created_at` AS `philhealth_verified_at`, `pha`.`case_rate_id` AS `philhealth_case_rate_id`, `pcr`.`code` AS `philhealth_code`, `pcr`.`description` AS `philhealth_description`, `pcr`.`rate_total` AS `philhealth_rate_total`
FROM `billing` `b`
LEFT JOIN `patients` `p` ON `p`.`id` = `b`.`patient_id`
LEFT JOIN `services` `s` ON `s`.`id` = `b`.`service_id`
LEFT JOIN `hmo_authorizations` `ha` ON `ha`.`id` = `b`.`hmo_authorization_id`
LEFT JOIN `hmo_providers` `hp` ON `hp`.`id` = `ha`.`provider_id`
LEFT JOIN `bill_philhealth_audits` `pha` ON `pha`.`id` = `b`.`philhealth_audit_id`
LEFT JOIN `philhealth_case_rates` `pcr` ON `pcr`.`id` = `pha`.`case_rate_id`
ORDER BY `b`.`created_at` DESC

    public function findWithRelations(int $id): ?array
    {
        $row = $this->withRelations()
            ->where('b.id', $id)
            ->get()->getRowArray();
---
SELECT `b`.*, CONCAT(p.first_name, ' ', p.last_name) AS patient_name, `p`.`address` AS `patient_address`, `p`.`phone` AS `patient_phone`, `s`.`name` AS `service_name`, `s`.`base_price` AS `service_price`, `ha`.`loa_number` AS `hmo_loa_number`, `ha`.`coverage_limit` AS `hmo_coverage_limit`, `ha`.`approved_amount` AS `hmo_approved_amount`, `ha`.`patient_share` AS `hmo_patient_share`, `ha`.`status` AS `hmo_status`, `ha`.`notes` AS `hmo_notes`, `hp`.`name` AS `hmo_provider_name`, `hp`.`id` AS `hmo_provider_id`, `pha`.`suggested_amount` AS `philhealth_suggested_amount`, `pha`.`approved_amount` AS `philhealth_approved_amount`, `pha`.`codes_used` AS `philhealth_codes_used`, `pha`.`officer_user_id` AS `philhealth_verified_by`, `pha`.`created_at` AS `philhealth_verified_at`, `pha`.`case_rate_id` AS `philhealth_case_rate_id`, `pcr`.`code` AS `philhealth_code`, `pcr`.`description` AS `philhealth_description`, `pcr`.`rate_total` AS `philhealth_rate_total`
FROM `billing` `b`
LEFT JOIN `patients` `p` ON `p`.`id` = `b`.`patient_id`
LEFT JOIN `services` `s` ON `s`.`id` = `b`.`service_id`
LEFT JOIN `hmo_authorizations` `ha` ON `ha`.`id` = `b`.`hmo_authorization_id`
LEFT JOIN `hmo_providers` `hp` ON `hp`.`id` = `ha`.`provider_id`
LEFT JOIN `bill_philhealth_audits` `pha` ON `pha`.`id` = `b`.`philhealth_audit_id`
LEFT JOIN `philhealth_case_rates` `pcr` ON `pcr`.`id` = `pha`.`case_rate_id`
WHERE `b`.`id` = 2

    public function getTotals(): array
    {
        $now = date('Y-m-01');
        $end = date('Y-m-t');

        // Total Revenue (paid)
        $totalRevenue = $this->builder()
            ->selectSum('final_amount', 'sum')
            ->where('payment_status', 'paid')
            ->get()->getRow('sum') ?? 0;

        // Pending Bills count
        $pendingCount = $this->builder()
            ->select('COUNT(*) AS cnt')
            ->where('payment_status', 'pending')
            ->get()->getRow('cnt') ?? 0;

        // Paid This Month (paid in current month by bill_date)
        $paidThisMonth = $this->builder()
            ->selectSum('final_amount', 'sum')
            ->where('payment_status', 'paid')
            ->where('bill_date >=', $now)
            ->where('bill_date <=', $end)
            ->get()->getRow('sum') ?? 0;
---
SELECT COUNT(*) AS cnt
FROM `billing`
WHERE `payment_status` = 'pending'
SELECT SUM(`final_amount`) AS `sum`
FROM `billing`
WHERE `payment_status` = 'pending'
SELECT SUM(`final_amount`) AS `sum`
FROM `billing`
WHERE `payment_status` = 'paid'
AND `bill_date` >= '2025-12-01'
AND `bill_date` <= '2025-12-31'