app/Models/BillingModel.php

SELECT `b`.*, CONCAT(p.first_name, ' ', p.last_name) AS patient_name, `p`.`address` AS `patient_address`, `p`.`phone` AS `patient_phone`, `s`.`name` AS `service_name`, `s`.`base_price` AS `service_price`
FROM `billing` `b`
LEFT JOIN `patients` `p` ON `p`.`id` = `b`.`patient_id`
LEFT JOIN `services` `s` ON `s`.`id` = `b`.`service_id`
WHERE `b`.`id` = 3
---
    public function findWithRelations(int $id): ?array
    {
        $row = $this->withRelations()
            ->where('b.id', $id)
            ->get()->getRowArray();