app/Models/DoctorScheduleModel.php

    public function getSchedulesByDateRange($startDate, $endDate)
    {
        return $this->where('shift_date >=', $startDate)
                   ->where('shift_date <=', $endDate)
                   ->orderBy('shift_date', 'ASC')
                   ->orderBy('start_time', 'ASC')
                   ->findAll();
---
SELECT *
FROM `doctor_schedules`
WHERE `shift_date` >= '2025-11-01'
AND `shift_date` <= '2025-11-30'
ORDER BY `shift_date` ASC, `start_time` ASC