app/Models/LaboratoryModel.php

SELECT *
FROM `laboratory`
WHERE `test_date` >= '2025-12-01'
AND `test_date` <= '2025-12-13'
---
    public function getTestStatistics(array $filters = []): array
    {
        $builder = $this->builder();

        if (!empty($filters['start_date'])) {
            $builder->where('test_date >=', $filters['start_date']);
        }

        if (!empty($filters['end_date'])) {
            $builder->where('test_date <=', $filters['end_date']);
        }

        if (!empty($filters['test_type'])) {
            $builder->where('test_type', $filters['test_type']);
        }

        if (!empty($filters['status'])) {
            $builder->where('status', $filters['status']);
        }

        $tests = $builder->get()->getResultArray();