app/Models/PatientVitalModel.php

SELECT *
FROM `patient_vitals`
WHERE `patient_id` = 'PAT-251120-0002'
ORDER BY `created_at` DESC
 LIMIT 1
---
    public function getLatestForPatient(string $patientId): ?array
    {
        return $this->where('patient_id', $patientId)
                    ->orderBy('created_at', 'DESC')
                    ->first();