app/Models/PatientModel.php

    public function searchPatients(string $term): array
    {
        $term = trim($term);
        if ($term === '') return [];
        $builder = $this->builder();
        $builder->select("id, CONCAT(first_name, ' ', COALESCE(last_name, '')) AS name");
        $builder->groupStart()
            ->like('first_name', $term)
            ->orLike('last_name', $term)
            ->groupEnd();
        $builder->orderBy('first_name', 'ASC');
        $builder->limit(10);
        return $builder->get()->getResultArray();
---
SELECT `id`, CONCAT(first_name, ' ', COALESCE(last_name, '')) AS name
FROM `patients`
WHERE   (
`first_name` LIKE '%fre%' ESCAPE '!'
OR  `last_name` LIKE '%fre%' ESCAPE '!'
 )
ORDER BY `first_name` ASC
 LIMIT 10