app/Controllers/Doctor/Doctor.php

    public function patientsView()
    {
        if (!session()->get('isLoggedIn')) { return redirect()->to('/login'); }
        if (!in_array(session()->get('role'), ['doctor', 'admin'])) { return redirect()->to('/dashboard'); }

        $patientModel = new PatientModel();
        $all = $patientModel->orderBy('first_name','ASC')->findAll();
---
SELECT *
FROM `patients`
ORDER BY `first_name` ASC