app/Controllers/Doctor/Doctor.php

SELECT `users`.`id` AS `doctor_id`, `users`.`id` AS `user_id`, `users`.`username`
FROM `users`
LEFT JOIN `roles` `r` ON `users`.`role_id` = `r`.`id`
WHERE `r`.`name` LIKE '%doctor%' ESCAPE '!'
ORDER BY `users`.`username` ASC
---
    public function schedule()
    {
        // Check if user is authenticated and has proper role
        if (!session()->get('isLoggedIn')) {
            return redirect()->to('/login');
        }

        $userRole = session()->get('role');
        if (!in_array($userRole, ['admin', 'doctor'])) {
            return redirect()->to('/dashboard')->with('error', 'Access denied. Insufficient permissions.');
        }

        // Get current date range (default to current month)
        $startDate = $this->request->getGet('start_date') ?? date('Y-m-01');
        $endDate = $this->request->getGet('end_date') ?? date('Y-m-t');

        // Get schedules for the date range
        $schedules = $this->doctorScheduleModel->getSchedulesByDateRange($startDate, $endDate);

        // Build dropdown options directly from users who have a doctor role
        $userModel = new UserModel();
        $doctors = $userModel->select('users.id AS doctor_id, users.id AS user_id, users.username')
                             ->join('roles r', 'users.role_id = r.id', 'left')
                             ->like('r.name', 'doctor', 'both')
                             ->orderBy('users.username', 'ASC')
                             ->findAll();